; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-3-10)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	s0 - location
	s1 - location
	s2 - location
	p2-0 - location
	p2-1 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s1)
	(at driver3 s2)
	(at driver4 s0)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at package1 s2)
	(at package2 s1)
	(at package3 s2)
	(at package4 s1)
	(at package5 s0)
	(at package6 s1)
	(at package7 s1)
	(at package8 s1)
	(at package9 s0)
	(at package10 s1)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 44)
	(= (time-to-walk p2-0 s2) 44)
	(= (time-to-walk s0 p2-0) 50)
	(= (time-to-walk p2-0 s0) 50)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 51)
	(= (time-to-walk p2-1 s2) 51)
	(= (time-to-walk s1 p2-1) 67)
	(= (time-to-walk p2-1 s1) 67)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 9)
	(= (time-to-drive s1 s0) 9)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 6)
	(= (time-to-drive s2 s0) 6)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 87)
	(= (time-to-drive s2 s1) 87)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s0)
	(at driver3 s1)
	(at truck1 s1)
	(at truck2 s0)
	(at truck3 s2)
	(at package1 s2)
	(at package2 s1)
	(at package3 s0)
	(at package4 s0)
	(at package5 s1)
	(at package6 s0)
	(at package7 s0)
	(at package8 s0)
	(at package9 s1)
	(at package10 s1)
	))

(:metric minimize (+ (+ (* 1  (total-time)) (* 1  (driven))) (* 4  (walked))))

)

; plan
1. (board-truck driver3 truck1 s2)
   deleted: (at driver3 s2) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 4 of 15
2. (load-truck package3 truck1 s2)
   deleted: (at package3 s2)
   added: (in package3 truck1)
   goals met: 4 of 15
3. (drive-truck truck1 s2 s0 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (driven) from 0 to 6
   goals met: 4 of 15
4. (unload-truck package3 truck1 s0)
   deleted: (in package3 truck1)
   added: (at package3 s0)
   goals met: 5 of 15
5. (board-truck driver2 truck2 s1)
   deleted: (at driver2 s1) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 5 of 15
6. (board-truck driver4 truck3 s0)
   deleted: (at driver4 s0) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 5 of 15
7. (drive-truck truck3 s0 s2 driver4)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   changed: (driven) from 6 to 12
   goals met: 6 of 15
8. (load-truck package4 truck2 s1)
   deleted: (at package4 s1)
   added: (in package4 truck2)
   goals met: 6 of 15
9. (drive-truck truck2 s1 s0 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (driven) from 12 to 21
   goals met: 7 of 15
10. (load-truck package9 truck1 s0)
   deleted: (at package9 s0)
   added: (in package9 truck1)
   goals met: 7 of 15
11. (unload-truck package4 truck2 s0)
   deleted: (in package4 truck2)
   added: (at package4 s0)
   goals met: 8 of 15
12. (drive-truck truck1 s0 s1 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (driven) from 21 to 30
   goals met: 9 of 15
13. (disembark-truck driver3 truck1 s1)
   deleted: (driving driver3 truck1)
   added: (at driver3 s1) (empty truck1)
   goals met: 10 of 15
14. (unload-truck package9 truck1 s1)
   deleted: (in package9 truck1)
   added: (at package9 s1)
   goals met: 11 of 15
15. (load-truck package5 truck2 s0)
   deleted: (at package5 s0)
   added: (in package5 truck2)
   goals met: 11 of 15
16. (drive-truck truck2 s0 s1 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (driven) from 30 to 39
   goals met: 10 of 15
17. (unload-truck package5 truck2 s1)
   deleted: (in package5 truck2)
   added: (at package5 s1)
   goals met: 11 of 15
18. (load-truck package6 truck2 s1)
   deleted: (at package6 s1)
   added: (in package6 truck2)
   goals met: 11 of 15
19. (load-truck package7 truck2 s1)
   deleted: (at package7 s1)
   added: (in package7 truck2)
   goals met: 11 of 15
20. (load-truck package8 truck2 s1)
   deleted: (at package8 s1)
   added: (in package8 truck2)
   goals met: 11 of 15
21. (drive-truck truck2 s1 s0 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (driven) from 39 to 48
   goals met: 12 of 15
22. (unload-truck package6 truck2 s0)
   deleted: (in package6 truck2)
   added: (at package6 s0)
   goals met: 13 of 15
23. (unload-truck package7 truck2 s0)
   deleted: (in package7 truck2)
   added: (at package7 s0)
   goals met: 14 of 15
24. (unload-truck package8 truck2 s0)
   deleted: (in package8 truck2)
   added: (at package8 s0)
   goals met: 15 of 15
